#+Title: My org init file. [WIP]

*** Set up authsource files

#+begin_src emacs-lisp :tangle yes
(setq auth-sources
 '((:source "~/.emacs.d/secrets/.authinfo.gpg")))
#+end_src

#+RESULTS:
| :source | ~/.emacs.d/secrets/.authinfo.gpg |

**** lsp-mode

 #+BEGIN_SRC emacs-lisp
   (use-package lsp-mode
     :ensure t
     :demand t
     :init (setq lsp-inhibit-message nil ; you may set this to t to hide messages from message area
		 lsp-eldoc-render-all nil
	         lsp-prefer-flymake nil
		 lsp-highlight-symbol-at-point nil)
     :config (add-hook `javascript-mode-hook (lambda () (lsp))))
 #+END_SRC

 #+RESULTS:
 : t

#+BEGIN_SRC emacs-lisp :tangle yes
(defhydra hydra-lsp (:exit t :hint nil)
  "
 Buffer^^               Server^^                   Symbol
-------------------------------------------------------------------------------------
 [_f_] format           [_M-r_] restart            [_d_] declaration  [_i_] implementation  [_o_] documentation
 [_m_] imenu            [_S_]   shutdown           [_D_] definition   [_t_] type            [_r_] rename
 [_x_] execute action   [_M-s_] describe session   [_R_] references   [_s_] signature"
  ("d" lsp-find-declaration)
  ("D" lsp-ui-peek-find-definitions)
  ("R" lsp-ui-peek-find-references)
  ("i" lsp-ui-peek-find-implementation)
  ("t" lsp-find-type-definition)
  ("s" lsp-signature-help)
  ("o" lsp-describe-thing-at-point)
  ("r" lsp-rename)

  ("f" lsp-format-buffer)
  ("m" lsp-ui-imenu)
  ("x" lsp-execute-code-action)

  ("M-s" lsp-describe-session)
  ("M-r" lsp-restart-workspace)
  ("S" lsp-shutdown-workspace))

  (define-key global-map (kbd "<f11>") 'hydra-lsp/body)
#+END_SRC

#+RESULTS:
: hydra-lsp/body

#+BEGIN_SRC emacs-lisp :tangle yes
(push "[/\\\\]vendor" lsp-file-watch-ignored)
#+END_SRC

#+RESULTS:
| [/\\]vendor | [/\\]\.git$ | [/\\]\.hg$ | [/\\]\.bzr$ | [/\\]_darcs$ | [/\\]\.svn$ | [/\\]_FOSSIL_$ | [/\\]\.idea$ | [/\\]\.ensime_cache$ | [/\\]\.eunit$ | [/\\]node_modules$ | [/\\]\.fslckout$ | [/\\]\.tox$ | [/\\]\.stack-work$ | [/\\]\.bloop$ | [/\\]\.metals$ | [/\\]target$ | [/\\]\.ccls-cache$ | [/\\]\.deps$ | [/\\]build-aux$ | [/\\]autom4te.cache$ | [/\\]\.reference$ |

#+begin_src emacs-lisp :tangle yes
(use-package lsp-treemacs
 :ensure t)
#+end_src

#+RESULTS:

*** Quick search through knowledge files

#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-agenda-custom-commands
               '("ks" "Knowledge search" search ""
                 ((org-agenda-files (append `("~/.org/knowledge.org") (directory-files-recursively "~/.org/knowledge/" ".*\\.org"))))))
#+END_SRC

#+RESULTS:
| ks | Knowledge search     | search                                                                                                             |   | ((org-agenda-files (append (` (~/.org/knowledge.org)) (directory-files-recursively ~/.org/knowledge/ .*\.org)))) |
| j  | My JIRA issues       | ((ejira-jql resolution = unresolved and assignee = currentUser() ((org-agenda-overriding-header Assigned to me)))) |   |                                                                                                                  |
| n  | Agenda and all TODOs | ((agenda ) (alltodo ))                                                                                             |   |                                                                                                                  |

